clarestudio/pic32mx-template/include/pic32/iomx2intr.h
/* $Id: iomx2intr.h,v 1.2 2016/05/29 20:19:44 clare Exp $ */
/*
 * special function registers
 */
#ifndef __PIC32MX2XX_INTR_H
#define __PIC32MX2XX_INTR_H

/*
 * interrupt control registers
 */
#define INTCON		__SFR__(0xBF881000)
#define INTCONCLR	__SFR__(0xBF881004)
#define INTCONSET	__SFR__(0xBF881008)
#define INTCONINV	__SFR__(0xBF88100C)
#define INTSTAT		__SFR__(0xBF881010)
#define IPTMR		__SFR__(0xBF881020)
#define IPTMRCLR	__SFR__(0xBF881024)
#define IPTMRSET	__SFR__(0xBF881028)
#define IPTMRINV	__SFR__(0xBF88102C)
#define IFS0		__SFR__(0xBF881030)
#define IFS0CLR		__SFR__(0xBF881034)
#define IFS0SET		__SFR__(0xBF881038)
#define IFS0INV		__SFR__(0xBF88103C)
#define IFS1		__SFR__(0xBF881040)
#define IFS1CLR		__SFR__(0xBF881044)
#define IFS1SET		__SFR__(0xBF881048)
#define IFS1INV		__SFR__(0xBF88104C)
#define IEC0		__SFR__(0xBF881060)
#define IEC0CLR		__SFR__(0xBF881064)
#define IEC0SET		__SFR__(0xBF881068)
#define IEC0INV		__SFR__(0xBF88106C)
#define IEC1		__SFR__(0xBF881070)
#define IEC1CLR		__SFR__(0xBF881074)
#define IEC1SET		__SFR__(0xBF881078)
#define IEC1INV		__SFR__(0xBF88107C)
#define IPC0		__SFR__(0xBF881090)
#define IPC0CLR		__SFR__(0xBF881094)
#define IPC0SET		__SFR__(0xBF881098)
#define IPC0INV		__SFR__(0xBF88109C)
#define IPC1		__SFR__(0xBF8810A0)
#define IPC1CLR		__SFR__(0xBF8810A4)
#define IPC1SET		__SFR__(0xBF8810A8)
#define IPC1INV		__SFR__(0xBF8810AC)
#define IPC2		__SFR__(0xBF8810B0)
#define IPC2CLR		__SFR__(0xBF8810B4)
#define IPC2SET		__SFR__(0xBF8810B8)
#define IPC2INV		__SFR__(0xBF8810BC)
#define IPC3		__SFR__(0xBF8810C0)
#define IPC3CLR		__SFR__(0xBF8810C4)
#define IPC3SET		__SFR__(0xBF8810C8)
#define IPC3INV		__SFR__(0xBF8810CC)
#define IPC4		__SFR__(0xBF8810D0)
#define IPC4CLR		__SFR__(0xBF8810D4)
#define IPC4SET		__SFR__(0xBF8810D8)
#define IPC4INV		__SFR__(0xBF8810DC)
#define IPC5		__SFR__(0xBF8810E0)
#define IPC5CLR		__SFR__(0xBF8810E4)
#define IPC5SET		__SFR__(0xBF8810E8)
#define IPC5INV		__SFR__(0xBF8810EC)
#define IPC6		__SFR__(0xBF8810F0)
#define IPC6CLR		__SFR__(0xBF8810F4)
#define IPC6SET		__SFR__(0xBF8810F8)
#define IPC6INV		__SFR__(0xBF8810FC)
#define IPC7		__SFR__(0xBF881100)
#define IPC7CLR		__SFR__(0xBF881104)
#define IPC7SET		__SFR__(0xBF881108)
#define IPC7INV		__SFR__(0xBF88110C)
#define IPC8		__SFR__(0xBF881110)
#define IPC8CLR		__SFR__(0xBF881114)
#define IPC8SET		__SFR__(0xBF881118)
#define IPC8INV		__SFR__(0xBF88111C)
#define IPC9		__SFR__(0xBF881120)
#define IPC9CLR		__SFR__(0xBF881124)
#define IPC9SET		__SFR__(0xBF881128)
#define IPC9INV		__SFR__(0xBF88112C)
#define IPC10		__SFR__(0xBF881130)
#define IPC10CLR	__SFR__(0xBF881134)
#define IPC10SET	__SFR__(0xBF881138)
#define IPC10INV	__SFR__(0xBF88113C)

#endif
